HW/products_reviews_app_api/app/controllers/products_controller.rb

  def index
    reviews = Review.where(product_id: params[:product_id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" IS NULL