HW/products_reviews_app_api/app/controllers/reviews_controller.rb

  def index
    product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_review
      @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]